src/cf/MDM/InformationRegisters/_ЗаявкиВСлужбуНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>_ЗаявкиВСлужбуНСИ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ЗаявкаВСлужбуНСИ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/MDM/Enums/_СтатусыЗаявокВСлужбуНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>_СтатусыЗаявокВСлужбуНСИ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/MDM/CommonModules/_ОбменMDM/Ext/Module.bsl
#Область ПоключениеКомпоненты   

Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("ВнешняяКомпонентаRMQ"));
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

Функция ПолучитьКомпонентуСервер()Экспорт
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции

Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьПодключениеКлиентСервер(КлиентКомпоненты)
	
	Попытка  
	СохДанные=Константы._НастройкиОбменаRMQ.Получить().Получить();
		КлиентКомпоненты.Connect(
				СохДанные.Адрес,
				СохДанные.Порт,
				СохДанные.Логин,
				СохДанные.Пароль,
				СохДанные.ВиртуальныйХост);
			Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	//Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
	
КонецПроцедуры

Процедура ПроверитьПодключениеСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПроверитьПодключениеКлиентСервер(КлиентКомпоненты);
	
КонецПроцедуры

#КонецОбласти  

#Область СинхронизацииДокументовЗаявка_в_НСИ
Процедура _Обмен() Экспорт  	

//Подключаем компонент	
КлиентКомпоненты = ПолучитьКомпонентуСервер();    
//Получаем настройки для обмена
СохДанные=Константы._НастройкиОбменаRMQ.Получить().Получить();


//Отправка заявок в систему MDM
Запрос= новый Запрос;
Запрос.Текст=
  "ВЫБРАТЬ
  |	_ЗаявкиВСлужбуНСИ.Заявка КАК Заявка
  |ИЗ
  |	РегистрСведений._ЗаявкиВСлужбуНСИ КАК _ЗаявкиВСлужбуНСИ
  |ГДЕ
  |	(_ЗаявкиВСлужбуНСИ.Заявка.СтатусЗаявки = ЗНАЧЕНИЕ(Перечисление._СтатусыЗаявокВСлужбуНСИ.Выполнена)
  |			ИЛИ _ЗаявкиВСлужбуНСИ.Заявка.СтатусЗаявки = ЗНАЧЕНИЕ(Перечисление._СтатусыЗаявокВСлужбуНСИ.Отказ))
  |	И НЕ _ЗаявкиВСлужбуНСИ.Отправлено"; 
Результат=Запрос.Выполнить();
Если НЕ Результат.Пустой() тогда 
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() цикл    
		 Попытка	
			Сериализатор= новый СериализаторXDTO(ФабрикаXDTO);
			Запись=новый ЗаписьJSON; 
			Запись.УстановитьСтроку();
			ИсхДанные=Выборка.Заявка;
			Сериализатор.ЗаписатьJSON(Запись,ИсхДанные.ПолучитьОбъект(),НазначениеТипаXML.Явное);
			ТекстСообщения=Запись.Закрыть();
			ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ТекстСообщения,СохДанные.ТочкаОбменаДок,СохДанные.ИмяОчередиДокВых,СохДанные.КлючМаршрутизацииДок); 
			// фиксируем отправку
			ЗаписатьЗаявку=РегистрыСведений._ЗаявкиВСлужбуНСИ.СоздатьМенеджерЗаписи();
		    ЗаписатьЗаявку.Заявка=Выборка.Заявка;
			ЗаписатьЗаявку.Отправлено=Истина;
			ЗаписатьЗаявку.Записать(Истина);			
          Исключение   
			ЗаписьжурналаРегистрации("Обмен: Заявки в НСИ",УровеньЖурналаРегистрации.Ошибка,,"Не удалось отправить заявку;"+Выборка.Заявка+" по причине "+ОписаниеОшибки());
		  КонецПопытки;	
		КонецЦикла;	
КонецЕсли;
// Прием заявок из Системы MDM
 
	Попытка
				КлиентКомпоненты.Connect(
				СохДанные.Адрес,
				СохДанные.Порт,
				СохДанные.Логин,
				СохДанные.Пароль,
				СохДанные.ВиртуальныйХост);
	//   КлиентКомпоненты.Connect("localhost",5672,"guest","guest","/");

		ИмяОчереди = СохДанные.ИмяОчередиДокВх;
		
		Попытка
					
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Если КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				КлиентКомпоненты.BasicAck();
				ОтветноеСообщение = ОтветноеСообщение;  
				ЧтениеJSON = Новый ЧтениеJSON;   
				ЧтениеJSON.УстановитьСтроку(ОтветноеСообщение);
	            ЗначениеОбъект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	            ЧтениеJSON.Закрыть();
	            ЗначениеОбъект.ОбменДанными.Загрузка = Истина;
	            ЗначениеОбъект.Записать();
		       	ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Иначе
				ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Очередь пустая!'");
			КонецЕсли;
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;


КонецПроцедуры
Процедура ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ТекстСообщения,ТочкаОбменаВх, ИмяОчередиВх, Ключ)
	
	Попытка
		СохДанные=Константы._НастройкиОбменаRMQ.Получить().Получить();
		КлиентКомпоненты.Connect(
				СохДанные.Адрес,
				СохДанные.Порт,
				СохДанные.Логин,
				СохДанные.Пароль,
				СохДанные.ВиртуальныйХост);
		
		ТочкаОбмена    = ТочкаОбменаВх;
		ИмяОчереди     = ИмяОчередиВх;
		ТекстСообщения = ТекстСообщения;
		КлючМаршрутизации = Ключ;
		
		КлиентКомпоненты.BasicPublish(
			ТочкаОбмена,
			КлючМаршрутизации,
			ТекстСообщения,
			1,
			Ложь);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Сообщение успешно отправлено!");
КонецПроцедуры
#КонецОбласти 


#Область СинхронизацииСправочникаНоменклатура
//Отправка
Процедура _СинхронизацияНоменклатуры()Экспорт  	

//Подключаем компонент	
КлиентКомпоненты = ПолучитьКомпонентуСервер();    
//Получаем настройки для обмена
СохДанные=Константы._НастройкиОбменаRMQ.Получить().Получить();
//регистрация к обмену стандартным механизмом планов обмена
Узел=ПланыОбмена.ПланОбменаНоменклатура.НайтиПоНаименованию("TOIR");

//Номенклатура
Запрос= новый Запрос;
Запрос.Текст=
  "ВЫБРАТЬ
  |	НоменклатураИзменения.Ссылка КАК Ссылка
  |ИЗ
  |	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
  |ГДЕ
  |	НоменклатураИзменения.Узел = &Узел"; 
Запрос.УстановитьПараметр("Узел", Узел);

Результат=Запрос.Выполнить();
Если НЕ Результат.Пустой() тогда 
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() цикл    
		 Попытка	
			Сериализатор= новый СериализаторXDTO(ФабрикаXDTO);
			Запись=новый ЗаписьJSON; 
			Запись.УстановитьСтроку();
			ИсхДанные=Выборка.Ссылка;
			Сериализатор.ЗаписатьJSON(Запись,ИсхДанные.ПолучитьОбъект(),НазначениеТипаXML.Явное);
			ТекстСообщения=Запись.Закрыть();
			ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ТекстСообщения,СохДанные.ТочкаОбменаНоменклатура,СохДанные.ИмяОчередиНоменклатура,СохДанные.КлючМаршрутизацииНоменклатура);
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Выборка.Ссылка);			 
		 Исключение   
			ЗаписьжурналаРегистрации("Обмен: Номенклатура в ТОИР",УровеньЖурналаРегистрации.Ошибка,,"Не удалось отправить номенклатуру в ТОИР "+Выборка.Ссылка+" по причине "+ОписаниеОшибки());
		  КонецПопытки;	
		КонецЦикла;	
	КонецЕсли; 

//Пользователи
Узел=ПланыОбмена.ПланОбменаНоменклатура.НайтиПоНаименованию("TOIR");

Запрос= новый Запрос;
Запрос.Текст=
  "ВЫБРАТЬ
  |	ПользователиИзменения.Ссылка КАК Ссылка
  |ИЗ
  |	Справочник.Пользователи.Изменения КАК ПользователиИзменения
  |ГДЕ
  |	ПользователиИзменения.Узел = &Узел"; 
Запрос.УстановитьПараметр("Узел", Узел);

Результат=Запрос.Выполнить();
Если НЕ Результат.Пустой() тогда 
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() цикл    
		 Попытка	
			Сериализатор= новый СериализаторXDTO(ФабрикаXDTO);
			Запись=новый ЗаписьJSON; 
			Запись.УстановитьСтроку();
			ИсхДанные=Выборка.Ссылка;
			Сериализатор.ЗаписатьJSON(Запись,ИсхДанные.ПолучитьОбъект(),НазначениеТипаXML.Явное);
			ТекстСообщения=Запись.Закрыть();
			ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ТекстСообщения,СохДанные.ТочкаОбменаНоменклатура,СохДанные.ИмяОчередиНоменклатура,СохДанные.КлючМаршрутизацииНоменклатура);
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Выборка.Ссылка);			 
		 Исключение   
			ЗаписьжурналаРегистрации("Обмен: Пользователи в ТОИР",УровеньЖурналаРегистрации.Ошибка,,"Не удалось отправить пользователя в ТОИР "+Выборка.Ссылка+" по причине "+ОписаниеОшибки());
		  КонецПопытки;	
		КонецЦикла;	
КонецЕсли;
//Пользователи
Узел=ПланыОбмена.ПланОбменаНоменклатура.НайтиПоНаименованию("TOIR");

Запрос= новый Запрос;
Запрос.Текст=
  "ВЫБРАТЬ
  |	КонтрагентыИзменения.Ссылка КАК Ссылка
  |ИЗ
  |	Справочник.Контрагенты.Изменения КАК КонтрагентыИзменения
  |ГДЕ
  |	КонтрагентыИзменения.Узел = &Узел"; 
Запрос.УстановитьПараметр("Узел", Узел);

Результат=Запрос.Выполнить();
Если НЕ Результат.Пустой() тогда 
	Выборка=Результат.Выбрать();
	Пока Выборка.Следующий() цикл    
		 Попытка	
			Сериализатор= новый СериализаторXDTO(ФабрикаXDTO);
			Запись=новый ЗаписьJSON; 
			Запись.УстановитьСтроку();
			ИсхДанные=Выборка.Ссылка;
			Сериализатор.ЗаписатьJSON(Запись,ИсхДанные.ПолучитьОбъект(),НазначениеТипаXML.Явное);
			ТекстСообщения=Запись.Закрыть();
			ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ТекстСообщения,СохДанные.ТочкаОбменаНоменклатура,СохДанные.ИмяОчередиНоменклатура,СохДанные.КлючМаршрутизацииНоменклатура);
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел,Выборка.Ссылка);			 
		 Исключение   
			ЗаписьжурналаРегистрации("Обмен: Контрагенты в ТОИР",УровеньЖурналаРегистрации.Ошибка,,"Не удалось отправить Контрагента в ТОИР "+Выборка.Ссылка+" по причине "+ОписаниеОшибки());
		  КонецПопытки;	
		КонецЦикла;	
КонецЕсли;

КонецПроцедуры

#КонецОбласти
